wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/bcp-create-transaction-response-pending.json

{
  "type": "transaction",
  "id": "f2b6147c-265c-46ab-9c65-9c8cba9d83ce",
  "reconciliation_id": "7NzLwVx5K7kG2TKcGduiWk",
  "merchant_account_id": "default",
  "currency": "PEN",
  "amount": 1600,
  "status": "buyer_approval_pending",
  "authorized_amount": 0,
  "captured_amount": 0,
  "refunded_amount": 0,
  "settled_currency": null,
  "settled_amount": 0,
  "settled": false,
  "country": "PE",
  "external_identifier": "466.5",
  "intent": "capture",
  "payment_method": {
    "type": "payment-method",
    "approval_url": "https://sandbox.dlocal.com/gmf-apm/payments/M-fbe42d09-09dc-4d56-a88b-b553b8b92930",
    "country": "PE",
    "currency": "PEN",
    "details": null,
    "expiration_date": null,
    "fingerprint": null,
    "label": null,
    "last_replaced_at": null,
    "method": "bcp",
    "mode": "redirect",
    "scheme": null,
    "id": null,
    "approval_target": "any",
    "external_identifier": null,
    "payment_account_reference": null
  },
  "method": "bcp",
  "instrument_type": "redirect",
  "error_code": null,
  "payment_service": {
    "type": "payment-service",
    "id": "1b26dd50-bf6c-486d-b34b-39b38fe5835a",
    "payment_service_definition_id": "dlocal-bcp",
    "method": "bcp",
    "display_name": "BCP"
  },
  "pending_review": false,
  "buyer": {
    "type": "buyer",
    "id": null,
    "display_name": null,
    "external_identifier": "jwales@example.com",
    "billing_details": {
      "first_name": "Jimmy",
      "last_name": "Wales",
      "email_address": "jwales@example.com",
      "phone_number": null,
      "address": {
        "city": null,
        "country": "PE",
        "postal_code": null,
        "state": null,
        "state_code": null,
        "house_number_or_name": null,
        "line1": null,
        "line2": null,
        "organization": null
      },
      "tax_id": { "value": "8480052240", "kind": "pe.ruc" }
    },
    "account_number": null
  },
  "raw_response_code": "100",
  "raw_response_description": "The payment is pending.",
  "shipping_details": null,
  "checkout_session_id": null,
  "gift_card_redemptions": [],
  "gift_card_service": null,
  "created_at": "2025-02-14T15:46:48.233315+00:00",
  "updated_at": "2025-02-14T15:46:49.585890+00:00",
  "airline": null,
  "auth_response_code": null,
  "avs_response_code": null,
  "cvv_response_code": null,
  "payment_source": "ecommerce",
  "merchant_initiated": false,
  "is_subsequent_payment": false,
  "cart_items": [],
  "statement_descriptor": null,
  "scheme_transaction_id": null,
  "three_d_secure": null,
  "payment_service_transaction_id": "R-2486-ca4f7f98-8d76-4771-928c-f351c8ac47fc",
  "additional_identifiers": {
    "payment_service_authorization_id": null,
    "payment_service_capture_id": null,
    "payment_service_processor_id": null
  },
  "metadata": null,
  "authorized_at": null,
  "captured_at": null,
  "voided_at": null,
  "approval_expires_at": "2025-02-14T16:46:48.336085+00:00",
  "buyer_approval_timedout_at": null,
  "intent_outcome": "pending",
  "multi_tender": false,
  "account_funding_transaction": false,
  "recipient": null
}
