wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/pse-create-transaction-response-pending.json

{
    "type": "transaction",
    "id": "71e6417d-b9dd-491c-9df8-88e4f71ff85a",
    "reconciliation_id": "3SvMKR8JG8ZaBAkyoIU4p0",
    "merchant_account_id": "default",
    "currency": "COP",
    "amount": 600000,
    "status": "buyer_approval_pending",
    "authorized_amount": 0,
    "captured_amount": 0,
    "refunded_amount": 0,
    "settled_currency": null,
    "settled_amount": 0,
    "settled": false,
    "country": "CO",
    "external_identifier": "458.8",
    "intent": "capture",
    "payment_method": {
        "type": "payment-method",
        "approval_url": "https:\/\/sandbox.dlocal.com\/gmf-apm\/payments\/M-37b0a33d-77af-42b3-b684-5d021f8ea216",
        "country": "CO",
        "currency": "COP",
        "details": null,
        "expiration_date": null,
        "fingerprint": null,
        "label": null,
        "last_replaced_at": null,
        "method": "pse",
        "mode": "redirect",
        "scheme": null,
        "id": null,
        "approval_target": "any",
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "pse",
    "instrument_type": "redirect",
    "error_code": null,
    "payment_service": {
        "type": "payment-service",
        "id": "186d3d93-b6c6-4bd0-9346-77e4d27d5d03",
        "payment_service_definition_id": "dlocal-pse",
        "method": "pse",
        "display_name": "Pagos Seguros Online (PSE)"
    },
    "pending_review": false,
    "buyer": {
        "type": "buyer",
        "id": null,
        "display_name": null,
        "external_identifier": "jwales@example.com",
        "billing_details": {
            "first_name": "Jimmy",
            "last_name": "Wales",
            "email_address": "jwales@example.com",
            "phone_number": null,
            "address": {
                "city": null,
                "country": "CO",
                "postal_code": null,
                "state": null,
                "state_code": null,
                "house_number_or_name": null,
                "line1": null,
                "line2": null,
                "organization": null
            },
            "tax_id": {
                "value": "9999999999",
                "kind": "co.nit"
            }
        },
        "account_number": null
    },
    "raw_response_code": "100",
    "raw_response_description": "The payment is pending.",
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "created_at": "2025-02-13T16:24:43.430434+00:00",
    "updated_at": "2025-02-13T16:24:44.657774+00:00",
    "airline": null,
    "auth_response_code": null,
    "avs_response_code": null,
    "cvv_response_code": null,
    "payment_source": "ecommerce",
    "merchant_initiated": false,
    "is_subsequent_payment": false,
    "cart_items": [],
    "statement_descriptor": null,
    "scheme_transaction_id": null,
    "three_d_secure": null,
    "payment_service_transaction_id": "R-2486-f8d1aa9c-d347-4066-9589-7c0121a2674f",
    "additional_identifiers": {
        "payment_service_authorization_id": null,
        "payment_service_capture_id": null,
        "payment_service_processor_id": null
    },
    "metadata": null,
    "authorized_at": null,
    "captured_at": null,
    "voided_at": null,
    "approval_expires_at": "2025-02-13T17:24:43.538308+00:00",
    "buyer_approval_timedout_at": null,
    "intent_outcome": "pending",
    "multi_tender": false,
    "account_funding_transaction": false,
    "recipient": null
}