wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/successful-transaction-trustly.json

{
    "type": "transaction",
    "id": "b332ca0a-1dce-4ae6-b27b-04f70db8fae7",
    "reconciliation_id": "5S8puSJHjzWXtSEbjHoiP9",
    "merchant_account_id": "default",
    "created_at": "2024-07-22T19:56:09.406614+00:00",
    "updated_at": "2024-07-22T19:56:22.853932+00:00",
    "amount": 3500,
    "authorized_amount": 0,
    "captured_amount": 0,
    "refunded_amount": 0,
    "currency": "USD",
    "country": "US",
    "external_identifier": "12354846.6",
    "status": "processing",
    "intent": "capture",
    "payment_method": {
        "type": "payment-method",
        "method": "trustly",
        "mode": "redirect",
        "label": null,
        "scheme": null,
        "expiration_date": null,
        "approval_url": "https:\/\/sandbox.paywithmybank.com\/start\/establish?accessId=Ev6e2YzsthnCLEefTdYs&token=Tx1FKxXqcK2FayXgxWpemZ7KJ4Rf14FyHIJgbZVJNCRzYjLo44Azfp5LvA0c%2BCE4ALAbGoxq3jOhy5qrHETzjiZhoy1gA%2FSlDoh2NKLJ6ZYlTmIvieTGY4V4O75wTfb2eHxLXGZSAmon60kpiOcpWN3tDeH5%2FfrgkKmE8lLVXDUf1g4Ida8gg74k%2FfX4F8%2FxKfE7DC444jfwysKQ9xdtPwdSG%2B%2FQfapNE1m75XVrLOzXV6eBm1g616w1msIkdkYx5%2B8CddNAQcl%2BKkooJNd7RR%2Bies8B14Jli%2F9FsCHV1HLUJamN6hnVRqJiuP1St2hq5mIAaz%2B09VlsBhf%2B0s1AlwQfHiHTyDHIuHM3nI2kq2v0wcXs98SDD21%2FaZxFM4QwcIVdCRKNd3K6Q7WaXdx1iY4vjCGwIr7MZ%2FJok4cxxtwpKhqTDOEVlLWWtlvKK1Cra4PB1xoGdoOv7OqMnbiLO0cWfjECfejTu%2FH%2FhMZ8ZCNsEiqo%2F8VTwVCRCXaSZz7FIU8O9y0bmaoNTAFleDQDHD9wrOWDczKZZ9W4JARXr2vmhGzIlqHGBoUFjbKwShVzH45ikqoXb7t%2F5GsDV8KBS0yJ5NwP0Y0to001uVv1iZowMuEDsRaaIcqvWz%2BUKaKddRv60mPI%2BpCoslCZKA3X3b26D%2F%2F99%2F%2B4dfWzJCTQ7Dr9P9GNeQAsoQdLvzAN9DrAKanB86hGhz%2FPrh68tXGP2%2BHWqvQQaCf6zZCGAxr3SFPdhLUKl8rGds9P19DK5pPnv%2BI%2FeAWxGpUD8GC4C9RXyDEuDla6s5gqfp94IhsyW%2FXUsMm72zJC8HkKaY62i%2FgSaKBhWSPRlaOq%2ByEvTmLrwMFbKaYMjud3JBI5Sr7j3IuQhtKjg9kCOHTSNTRtgdojBxSoVENDkim3XwSK9NfKj1xDDtc9UyvmSiFD3qeoqSyPiVHiuiaudyfHu8sbjPusY34R39sptDbiYovOzF%2B5LXyHDCafEumiuD%2FPgioAY60%3D",
        "country": "US",
        "currency": "USD",
        "details": null,
        "last_replaced_at": null,
        "fingerprint": null,
        "id": "80b0fed6-0120-4079-96d4-aec315a7b125",
        "approval_target": "any",
        "external_identifier": null,
        "payment_account_reference": null
    },
    "method": "trustly",
    "instrument_type": "redirect",
    "error_code": null,
    "payment_service": {
        "id": "9996be63-1e6f-4290-9d6e-b70f5d9b6bf8",
        "type": "payment-service",
        "payment_service_definition_id": "adyen-card",
        "method": "card",
        "display_name": "Adyen"
    },
    "pending_review": false,
    "buyer": {
        "id": "60c52dcd-8405-452d-8f7e-80f3d49b8f95",
        "type": "buyer",
        "display_name": "Jimmy Wales",
        "external_identifier": "jwales@example.com",
        "billing_details": {
            "first_name": "Jimmy",
            "last_name": "Wales",
            "email_address": "jwales@example.com",
            "phone_number": null,
            "address": {
                "city": "San Francisco",
                "country": "US",
                "postal_code": "94104",
                "state": "CA",
                "state_code": null,
                "house_number_or_name": null,
                "line1": "1 Montgomery Street",
                "line2": null,
                "organization": null
            },
            "tax_id": null
        }
    },
    "raw_response_code": null,
    "raw_response_description": null,
    "shipping_details": null,
    "checkout_session_id": null,
    "gift_card_redemptions": [],
    "gift_card_service": null,
    "auth_response_code": null,
    "avs_response_code": "unavailable",
    "cvv_response_code": "unavailable",
    "payment_source": "ecommerce",
    "merchant_initiated": false,
    "is_subsequent_payment": false,
    "cart_items": [],
    "statement_descriptor": null,
    "scheme_transaction_id": null,
    "three_d_secure": null,
    "payment_service_transaction_id": "G7TWDQ5LBKKKP275",
    "metadata": null,
    "authorized_at": "2024-07-22T19:56:10.642724+00:00",
    "captured_at": "2024-07-22T19:56:22.853932+00:00",
    "voided_at": null,
    "approval_expires_at": null,
    "buyer_approval_timedout_at": null,
    "intent_outcome": "succeeded",
    "multi_tender": false
}