wikimedia/smash-pig/PaymentProviders/Gravy/Tests/Data/trustly-create-payment-request.json

{
  "amount": 100000,
  "currency": "USD",
  "country": "US",
  "intent": "capture",
  "payment_method": { "method": "trustly", "country": "US", "currency": "USD" },
  "external_identifier": "907184.1",
  "buyer": {
    "external_identifier": "lorem@ipsum",
    "billing_details": {
      "first_name": "Lorem",
      "last_name": "Ipsum",
      "email_address": "lorem@ipsum",
      "phone_number": null,
      "address": {
        "city": null,
        "country": "US",
        "postal_code": "1234",
        "state": null,
        "line1": "10 hopewell street",
        "line2": null,
        "organization": "Wikimedia Foundation"
      }
    }
  }
}
